In [1]:
import os
os.environ['DJANGO_SETTINGS_MODULE'] = 'recommendation.settings'
import django
django.setup()

In [3]:
import sys
sys.path.append(os.path.dirname(os.path.abspath(os.path.dirname("./testing"))))

In [2]:
from polls.models import UserNewsTable, AuthUser, NewsInfoTable

In [6]:
from sqlalchemy import create_engine
from user.others.config_info import *
import pandas as pd
import numpy as np

In [4]:
engine = create_engine(DB_address)
print(engine)

Engine(mysql+pymysql://lee:***@35.230.61.91/rec_system?charset=utf8mb4)

In [24]:
table = pd.read_sql(sql = 'select * from news_latent_space_table', con = engine)
table.head()

   news_id                                       latent_space
0        1  -0.06610630452632904 0.04264305159449577 -0.02...
1        2  0.07411015033721924 -0.11837325990200043 -0.04...
2        3  -0.03404729813337326 0.021520812064409256 0.03...
3        4  0.09065058827400208 -0.1361929178237915 0.0211...
4        5  -0.005369893740862608 -0.00956411100924015 0.0...

In [23]:
table = pd.read_sql(sql = 'select * from preprocessed_news_table', con = engine)
table.head()

   news_id                               preprocessed_content
0        1  한/determiner 국산/noun 철강/noun 관세/noun 폭탄/noun 면...
1        2  삼성/noun 바이오/noun 로/josa 직스/noun 분식회계/noun 맞다/v...
2        3  물벼락/noun 가다/verb 조현민/noun 경찰/noun 출석/noun 서울/n...
3        4  삼성/noun 이재용/noun 롯데/noun 신동빈/noun 총수/noun 로/jo...
4        5  백악관/noun 한/determiner 국산/noun 철강/noun 고율/noun ...

In [9]:
table = pd.read_sql(sql = 'select * from news_info_table', con = engine)
table.head()

,news_id,category,date,title,content
0,1,economy,20180501,"美, '한국산 철강 관세폭탄' 면제 확정…관세유예국 중 유일(종합2보)","EU·멕시코·캐나다, 철강관세 유예 6월 1일까지 연장정부 ""불확실성 완전 해소…관..."
1,2,economy,20180501,"""삼성바이오로직스, 분식회계 맞다""…주식 매매 중단까지?",[뉴스데스크]◀ 앵커 ▶삼성그룹의 차세대 핵심 사업으로 꼽히는 삼성 바이오로직스가 ...
2,3,economy,20180501,"'물벼락 갑질' 조현민, 경찰 출석",(서울=연합뉴스) 한상균 기자 = '물벼락 갑질' 논란 조현민 전 대한항공 광고담당...
3,4,economy,20180501,"삼성 이재용·롯데 신동빈 총수로…공정위, 30년만에 변경","""지분·영향력 요건 충족하는 중대·명백한 사정변경 확인""네이버 이해진에 대해선 ""변..."
4,5,economy,20180501,"백악관, 한국산 철강 고율관세 면제 확정 발표",(서울=연합뉴스) 장재은 기자 = 백악관은 30일(현지시간) 한국산 철강에 대한 고...

In [11]:
random_idx = np.random.choice(len(table), 100, replace = False)
print(random_idx)

[ 4519 25006 28875 24679  6014 15930  8020  2594 20706  9613  6505  7757
 25876 10686 22074 24921 13822 23596 13995 24287  3591 14921 28030 25968
 13178 14769 24212  4995 16418 27166 11516 20550  1343  8755  4965  1336
  3946 15463 20169 11455 21161 13820   696 11683 20411  8499 18815   813
  3154  2507 14335 27436 15753 23223   669 15657 12054  5126  9105 22915
 22784  6696 14084 11256 16287 28539 24101 11616  2481 20512  9441 19935
 25497 27008  6844  6228 28660 19690 28319 22392 25064 11165 15807 18041
 18793  6163 20350 22240 22231 11273 13095 27357  4196  4692  3970 16804
  6164  8208 14755  8586]

In [15]:
randomNewsList = table.loc[random_idx]
print(len(randomNewsList))
randomNewsList.head()

100

,news_id,category,date,title,content
4519,4520,economy,20180928,“추석 지나면 매물 나왔는데...” 얼어붙은 아파트 매매,서울 부동산 시장 둘러보니... 매물ㆍ문의 사라져 거래 절벽“보통 추석이 지나면 연...
25006,25007,world,20180526,"백악관 ""6·12 북미정상회담 열린다면 우린 준비돼 있을 것""(종합2보)","""트럼프, 싸구려 정치적 곡예 하려는 게 아니라 오래 지속하는 실질적 해법 원해""(..."
28875,28876,world,20181002,남중국해서 미중 군함 충돌직전 접근 '일촉즉발'…중국 반발(종합),"""41ｍ 앞까지 부딪힐 듯 접근""…무역 이어 군사긴장도 첨예화中국방부 ""중국 주권·..."
24679,24680,world,20180514,갖은 박해에도 선진국 반열···건국 자체가 기적인 이 나라,외교국방과 경제는 양지14일로 현대 이스라엘 70세 생일 2000년 전 조상의 땅에...
6014,6015,living,20180608,"""○○ 아빠, ○○ 엄마"" 이런 부부, 은퇴 후가 위험하다","[더,오래] 박혜은의 님과 남(24) 어쩌면 ‘진짜 부부생활’은 은퇴 후부터가 아닐..."

In [36]:
context = dict()
context['newsInfo'] = []

for idx, newsInfo in randomNewsList.iterrows() :
    temp = dict()
    temp['news_id'] = newsInfo['news_id']
    temp['date'] = newsInfo['date']
    temp['category'] = newsInfo['category']
    temp['content'] = newsInfo['content']
    
    context['newsInfo'].append(temp)

In [37]:
print(len(context['newsInfo']))

100

In [38]:
context['newsInfo'][0]

{'news_id': 4520,
 'date': '20180928',
 'category': 'economy',
 'content': '서울 부동산 시장 둘러보니... 매물ㆍ문의 사라져 거래 절벽“보통 추석이 지나면 연휴 기간 오랜만에 모인 가족들과 상의 후 나오는 매물도 있고, 문의 전화도 많은데 올해는 움직임이 전혀 없네요. 9ㆍ13 대책 이후 눈치보기 장세가 계속되고 있다고 보면 됩니다.” 정부가 치솟는 서울 집값을 잡기 위해 강도 높은 규제책인 9ㆍ13 부동산 대책과 9ㆍ21 공급 대책을 잇따라 발표하고 추석 연휴도 지났지만 다시 문을 연 부동산 중개업소엔 매물은 나오지 않고 있다. 고가주택일수록 매도 시 세금부담이 적지 않은데다 똘똘한 한 채에 대한 선호도도 높아 당분간 매물을 보유하려는 집주인과 매수자간 치열한 눈치싸움이 이어질 가능성이 커 보인다. 27일 서울 송파구 잠실새내역 인근 D부동산중개사무소를 찾아 추석 이후 부동산 시장 상황을 묻자 김모(62) 대표는 “해줄 말이 없다”며 손사래를 쳤다. 김 대표는 “오전 9시 가게 문을 열고 6시간이 넘도록 팔 의사도 없는 집주인들의 ‘간보기’ 전화 2통을 받은 게 전부인데 뭔 시장 상황이냐”고 되물었다. 강남구 매봉역 인근 K공인중개사무소도 상황은 비슷했다. 1건의 새로운 매물이 나오기는 했지만 9ㆍ13 대책 발표 이전 호가와 큰 차이가 없고 매수하겠다는 사람들도 전혀 나타나지 않고 있기 때문이다. K공인중개사무소 대표는 “내놓는 사람은 가격을 낮추지 않고 있고, 그 가격에 사겠다는 사람은 없다”며 “9ㆍ13대책 이후 사실상 거래가 중단됐는데 이 상황을 시장이 안정됐다고 볼 수 있을지 의문”이라고 지적했다. 다만 강북에선 강남권과는 다소 온도 차가 났다. 실제 거래까진 성사되지 않았지만 물건의 합당한 가격과 매물 유무 등을 묻는 문의가 활발하게 이뤄졌다. 강북구 미아동 북서울꿈의숲 인근 한 부동산중개사무소 실장은 “현재 등록된 매물 가운데 실제 매물은 이번 주말 사이에 대부분 매매될 것으로 보인다”며 “정부의 대출 규제와 조정지역 2주택 구매 압박을 해도 6억원대의 자산으로 서울에 진입하려는 사람들은 많다 보니 매물이 나오면 팔리는 것은 시간 문제”라고 자신했다. 노원구 역시 실수요자들의 관심이 이어지고 있어 거래 절벽을 걱정하진 않는 분위기다. 상계역 인근 부동산중개사무소 대표는 “9ㆍ13 대책 때 나온 대출 관련 정책으로 시장이 조금 위축된 영향은 있는데, 그래도 워낙 실수요자들이 많이 찾는 동네라 이번 주 지나면 정상적인 매매를 원하는 매물은 조금 나올 것”이라며 “시장 분위기를 물어보는 집주인 전화가 오면 물건을 내놓으라고 설득하고 있다”고 말했다.하지만 거래 절벽에도 추석 이후 나온 매물 역시 호가는 좀처럼 수그러들지 않고 있다. 이날 매물로 나온 강남구 도곡동 삼성래미안 전용 122㎡는 호가가 22억5,000만원으로 9ㆍ13 대책 이전에 나왔던 매물들과 비슷했다. 이 단지의 실거래가는 21억원 안팎이다. 송파구 잠실리센츠 전용 84㎡ 역시 실거래가보다는 1억원 가량 높은 가격에 호가가 나왔다. 추석 직전 4억5,000만원에 거래된 서대문구 홍제동 힐스테이트 전용 59㎡ 아파트는 추석 이후 6억3,000만원에 매물이 나왔다. 전문가들은 가을 성수기임에도 당분간 거래 절벽이 지속될 것으로 내다봤다. 함영진 직방 빅데이터 랩장은 “서울 아파트값 상승폭이 한풀 꺾였지만 매수ㆍ매도자 눈치보기가 심해 호가 조정은 쉽지 않을 것”이라면서 “특히 강남권 거주자들은 매도나 증여 모두 비용이 만만치 않다 보니 매물로 내놓기 보다는 거주나 장기 보유쪽으로 갈 가능성이 높다”고 말했다.김기중기자 정재호기자 next88@hankookilbo.com▶▶'}

In [40]:
context['newsInfo'][-1]

{'news_id': 8587,
 'date': '20180902',
 'category': 'living',
 'content': '휴일인 내일, 내륙은 비 소식 없이 구름만 많은 날씨가 이어지겠습니다.다만 큰 일교차에 주의하셔야겠는데요.내일 서울의 아침 기온은 20도로 선선하겠지만, 낮에는 기온이 30도까지 오르며 오늘만큼 덥겠습니다.내륙과 달리 제주도에는 비가 내리고 있는데요.내일 낮까지 제주도에는 최고 120mm 이상의 호우가 쏟아지겠습니다.벼락과 돌풍을 동반하며 국지적으로 강하게 쏟아질 것으로 보이니까요, 호우 피해 발생하지 않도록 각별히 주의하셔야겠습니다.그 밖의 내륙은 구름만 많은 날씨가 이어지겠습니다.내일 아침 기온은 20도 안팎을 보이겠습니다.서울 아침기온 20도, 광주 21도, 대구는 18도로 예상됩니다.낮 동안 내륙을 중심으로 늦더위가 나타나겠습니다.서울 낮기온 30도, 광주 30도, 대구는 27도로 예상됩니다.다음 주 월요일과 화요일 사이에는 전국에 비가 내리겠고요.이후에는 늦더위가 조금씩 수그러들 전망입니다.지금까지 날씨정보였습니다.[저작권자(c) YTN & YTN PLUS 무단전재 및 재배포 금지]'}

In [21]:
table = pd.read_sql(sql = 'select * from auth_user', con = engine)
table.head()

,id,password,last_login,is_superuser,username,first_name,last_name,email,is_staff,is_active,date_joined
0,16,pbkdf2_sha256$120000$cFTSg4YJfBtB$pih//s+5vzIH...,2018-11-02 11:52:52.759443,1,arc3577,,,arc3577@gmail.com,1,1,2018-10-26 05:59:10.942421
1,17,pbkdf2_sha256$120000$amPdJsEMvovj$e7NmVCibe/rM...,2018-10-31 05:38:57.227755,0,김치,,,arc3577@naver.com,0,1,2018-10-27 09:56:44.979260
2,18,pbkdf2_sha256$120000$7SRHdffh8jlm$vM92oCP45Tx+...,2018-10-27 12:27:03.954897,0,1,,,1,0,1,2018-10-27 12:15:36.860292
3,19,pbkdf2_sha256$120000$iGAjGMXZaTip$iEV+L6tQCn7R...,2018-11-01 14:57:05.693401,0,감자,,,1234,0,1,2018-10-29 06:43:37.076510
4,20,pbkdf2_sha256$120000$N6jN3JP9ebdA$ouc0fioeHKMM...,2018-11-01 15:47:30.341828,0,고구마,,,1234,0,1,2018-10-29 14:42:14.484988

#### 모든 데이터를 바로 불러오기

In [25]:
user_news_table = pd.read_sql(sql = 'select * from user_news_table', con = engine)
user_news_table.head()

   Id  user_id  news_id  count           read_time
0   2       16    18299      1 2018-10-29 14:24:51
1   3       16    27944      1 2018-10-29 14:26:32
2   4       16    16427      2 2018-10-29 14:47:38
3   5       16    21726      1 2018-10-29 14:27:42
4   6       16    22191      3 2018-10-29 14:28:44

#### 해당  아이디가 읽은 뉴스 가져오기

In [29]:
user_news_table = pd.read_sql(sql = 'select * from user_news_table where user_id = 16', con = engine)
user_news_table.head(20)

   Id  user_id  news_id  count           read_time
0   2       16    18299      1 2018-10-29 14:24:51
1   3       16    27944      1 2018-10-29 14:26:32
2   4       16    16427      2 2018-10-29 14:47:38
3   5       16    21726      1 2018-10-29 14:27:42
4   6       16    22191      3 2018-10-29 14:28:44

#### 해당 아이디가 읽은 뉴스를 시간 순으로 가져오기(최근에 읽은 뉴스가 밑으로 가게)

In [30]:
user_news_table = pd.read_sql(sql = 'select * from user_news_table where user_id = 16 order by read_time ASC', con = engine)
user_news_table.head(20)

   Id  user_id  news_id  count           read_time
0   2       16    18299      1 2018-10-29 14:24:51
1   3       16    27944      1 2018-10-29 14:26:32
2   5       16    21726      1 2018-10-29 14:27:42
3   6       16    22191      3 2018-10-29 14:28:44
4   4       16    16427      2 2018-10-29 14:47:38

In [35]:
print(user_news_table['news_id'], "\n\n")
print(list(user_news_table['news_id']))

0    18299
1    27944
2    21726
3    22191
4    16427
Name: news_id, dtype: int64


[18299, 27944, 21726, 22191, 16427]